W6D3/first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    all_users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'joe'"], ["email", "'joe@gmail.com"], ["created_at", "2021-02-24 09:35:30.256822"], ["updated_at", "2021-02-24 09:35:30.256822"]]
---
  def create
    user = User.create!(params.require(:user).permit(:name, :email))